// **. Напишите программу, которая на вход принимает значение, а
// на выходе показывает обратное значение.

string M = Console.ReadLine();
float N = float.Parse(M);

Console.Write($"{N} -> {1 / N}");
